Tekla Open API Reference for Tekla Structures 2025
LinkAttributes Class
 The LinkAttributes class contains the attributes for controlling the appearance of a link.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.LinkAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class LinkAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class LinkAttributes
	Inherits AttributesBase
The LinkAttributes type exposes the following members.
Constructors
Name | Description
LinkAttributes()
 Creates a new link attributes instance using standard attributes.
LinkAttributes(String)
 Creates a new link attributes instance loading the specified attributes.
Top
Properties
Name | Description
Font
 Gets or sets the font attributes.
Frame
 Gets or sets the link frame attributes.
IsUnderlined
 Defines whether the link is underlined or not.
Scaling
 Gets or sets the link scaling options.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the link frame attributes from the specified file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
Examples
 The following code shows how to load user-defined attributes that are named "red":
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           LinkAttributes linkAttributes = new LinkAttributes("red");
       }
}
See Also
Reference
Tekla.Structures.Drawing Namespace